[
    {
      "name": "ToDo App on Github",
      "description": "A web-based ToDo application to manage tasks that stores its data in Github using Octokit and allows authentication",
      "github_link": "https://github.com/AkashDas253/Todo_Github.git",
      "live_link": "http://toosaddas.pythonanywhere.com/"
    },
    {
      "name": "TalktoLearn",
      "description": "A chatbot for learning new topics",
      "github_link": "https://github.com/AkashDas253/TalktoLearn.git",
      "live_link": "http://toosaddas.pythonanywhere.com/"
    },
    {
      "name": "Noise Removal from Image",
      "description": "This repository contains implementations of various image processing papers. Each implementation includes a PDF of the paper and a C program that implements the paper's methods.",
      "github_link": "https://github.com/AkashDas253/Paper_Implementation.git"
    },
    {
      "name": "Weather App",
      "description": "A web-based weather application that allows users to search for current weather conditions and hourly forecasts by city name. The app utilizes the Open Meteo API for weather data and the OpenStreetMap Nominatim API for geocoding. It features a clean interface with input fields for city names, and displays weather details including temperature, wind speed, and hourly forecasts. The application handles errors gracefully and updates the interface to show relevant information based on user queries.",
      "github_link": "https://github.com/AkashDas253/weather-app.git",
      "live_link": "https://akashdas253.github.io/WeatherApp/"
    },
    {
      "name": "Tic-Tac-Toe Game with AI Bots",
      "description": "This web-based Tic-Tac-Toe game features various AI bots, including an Easy Bot, Minimax Bot, and Alpha-Beta Bot. The game allows for dynamic board sizes and different game modes, enabling players to compete against either a human opponent or one of the bots. The Minimax tree used by the bots is precomputed and stored in a JSON file, ensuring efficient and optimal move decisions. The project includes a user-friendly interface for selecting bots, setting game configurations, and playing the game.",
      "github_link": "https://github.com/AkashDas253/tictactoe.git",
      "live_link": "https://akashdas253.github.io/TicTacToe/"
    }
    
  ]
